app/controllers/plans_controller.rb

SELECT "plans".* FROM "plans"
---
    def index
        plans = Plan.all

SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        plan = Plan.find_by(id: params[:id])