app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
    def index
        students = Student.all

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        student = Student.find(params[:id])

UPDATE "students" SET "currentTerm" = $1, "advisingTerm" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["currentTerm", "Fall 2022"], ["advisingTerm", "Spring 2023"], ["updated_at", "2022-10-23 23:57:31.673685"], ["id", 1]]
---
    def create
        student = Student.create(student_params)
        student.user_id = @current_user.id
        student.save

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "currentTerm" = $1, "advisingTerm" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["currentTerm", "Fall 2022"], ["advisingTerm", "Spring 2023"], ["updated_at", "2022-10-23 23:57:31.673685"], ["id", 1]]
---
    def update
        student = Student.find_by(id: params[:id])
        student.update(student_params)